[
  {
    "year": 1990,
    "systemName": "โครงสร้างพื้นฐานคอมพิวเตอร์ยุคแรก0ib'",
    "organization": "สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ (สวทช.)",
    "description": "สวทช. ก่อตั้งขึ้นเพื่อส่งเสริมการพัฒนาวิทยาศาสตร์และเทคโนโลยีในประเทศไทย โครงสร้างพื้นฐานคอมพิวเตอร์ยุคแรกได้รับการพัฒนาขึ้นเพื่อสนับสนุนกิจกรรมการวิจัยในสาขาวิทยาศาสตร์ต่างๆ",
    "link": "https://www.nstda.or.th/th"
  },
  {
    "year": 1995,
    "systemName": "คอมพิวเตอร์เพื่อการวิจัยในมหาวิทยาลัย",
    "organization": "จุฬาลงกรณ์มหาวิทยาลัย มหาวิทยาลัยเทคโนโลยีพระจอมเกล้า",
    "description": "มหาวิทยาลัยชั้นนำเริ่มจัดตั้งศูนย์คอมพิวเตอร์เฉพาะเพื่อสนับสนุนการวิจัยในสาขาวิศวกรรมศาสตร์ วิทยาศาสตร์ และการศึกษาเชิงคำนวณ ระบบเหล่านี้เป็นรากฐานสำคัญของการคำนวณขั้นสูงในประเทศไทย",
    "link": "https://www.chula.ac.th/th/"
  },
  {
    "year": 2000,
    "systemName": "โครงการกริดคอมพิวติ้งแห่งชาติ",
    "organization": "สวทช. เนคเทค และกลุ่มมหาวิทยาลัย",
    "description": "ประเทศไทยเปิดตัวโครงการกริดคอมพิวติ้งแห่งชาติครั้งแรก เชื่อมโยงมหาวิทยาลัยและสถาบันวิจัยหลายแห่งเพื่อแบ่งปันทรัพยากรการคำนวณและร่วมมือในโครงการวิจัยขนาดใหญ่ เนคเทคมีบทบาทสำคัญในการประสานงานโครงสร้างกริดยุคแรก",
    "link": "https://www.nstda.or.th/th"
  },
  {
    "year": 2005,
    "systemName": "โครงการโครงสร้างพื้นฐานคอมพิวเตอร์ขั้นสูง",
    "organization": "กระทรวงวิทยาศาสตร์และเทคโนโลยี",
    "description": "โครงการของรัฐบาลเพื่อจัดตั้งโครงสร้างพื้นฐานคอมพิวเตอร์ขั้นสูงเพื่อสนับสนุนความสำคัญของการวิจัยระดับชาติ รวมถึงเทคโนโลยีชีวภาพ วัสดุศาสตร์ และการศึกษาสิ่งแวดล้อม",
    "link": ""
  },
  {
    "year": 2007,
    "systemName": "กลุ่มโครงสร้างพื้นฐาน e-Science แห่งชาติ",
    "organization": "เนคเทค",
    "description": "การจัดตั้งกลุ่มโครงสร้างพื้นฐาน e-Science แห่งชาติภายใต้เนคเทค เพื่อประสานงานและพัฒนาโครงสร้างพื้นฐาน e-Science ทั่วประเทศไทย กลุ่มนี้กลายเป็นเสาหลักสำคัญสำหรับการประสานงานคอมพิวเตอร์วิจัยระดับชาติ",
    "link": "http://www.e-science.in.th/"
  },
  {
    "year": 2010,
    "systemName": "โครงสร้างพื้นฐาน e-Science แห่งชาติไทย",
    "organization": "สวทช. และกลุ่มโครงสร้างพื้นฐาน e-Science แห่งชาติ",
    "description": "การพัฒนาโครงสร้างพื้นฐาน e-Science ที่ครอบคลุม รวมถึงทรัพยากรคอมพิวเตอร์ประสิทธิภาพสูง ระบบจัดเก็บข้อมูล และการเชื่อมต่อเครือข่ายเพื่อสนับสนุนโครงการวิจัยระดับชาติ กลุ่มให้บริการ HPC และความสามารถกริดคอมพิวติ้ง",
    "link": "http://www.e-science.in.th/"
  },
  {
    "year": 2015,
    "systemName": "โครงการปรับปรุง HPC สู่ยุคใหม่",
    "organization": "สวทช. และสถาบันการศึกษา",
    "description": "การปรับปรุงโครงสร้างพื้นฐาน HPC ขั้นใหญ่ด้วยโปรเซสเซอร์หลายแกนสมัยใหม่ ตัวเร่ง GPU และการเชื่อมต่อความเร็วสูงเพื่อสนับสนุนแอปพลิเคชันวิทยาศาสตร์เชิงคำนวณที่เกิดขึ้นใหม่",
    "link": ""
  },
  {
    "year": 2019,
    "systemName": "การก่อตั้ง ThaiSC",
    "organization": "ศูนย์ซูเปอร์คอมพิวเตอร์แห่งชาติ สวทช. (ThaiSC)",
    "description": "การก่อตั้ง ThaiSC อย่างเป็นทางการในฐานะศูนย์ซูเปอร์คอมพิวเตอร์แห่งชาติของประเทศไทย เป็นจุดสำคัญในการพัฒนา HPC ของประเทศ ThaiSC ก่อตั้งขึ้นเพื่อให้บริการ HPC ล้ำสมัยสำหรับชุมชนวิจัยและพัฒนาระดับชาติ",
    "link": "https://thaisc.io/"
  },
  {
    "year": 2020,
    "systemName": "ซูเปอร์คอมพิวเตอร์ LANTA",
    "organization": "ThaiSC สวทช.",
    "description": "การติดตั้งระบบ LANTA ซูเปอร์คอมพิวเตอร์เรืองธงของประเทศไทยที่มี CPU 31,744 คอร์ และ GPU NVIDIA A100 จำนวน 704 ตัว LANTA สนับสนุนชีวสารสนเทศศาสตร์ การจำลอง การพยากรณ์อากาศ และการวิจัย AI ทั่วประเทศ",
    "link": "https://thaisc.io/thaisc-resorces/lanta"
  },
  {
    "year": 2021,
    "systemName": "การขยาย HPC ในมหาวิทยาลัย",
    "organization": "มหาวิทยาลัยเชียงใหม่ มหาวิทยาลัย CMKL",
    "description": "มหาวิทยาลัยชั้นนำติดตั้งระบบ HPC เฉพาะ รวมถึง ERAWAN ที่มหาวิทยาลัยเชียงใหม่ และ APEX ที่มหาวิทยาลัย CMKL ขยายระบบนิเวศ HPC แบบกระจายของประเทศไทยสำหรับแอปพลิเคชันวิจัยเฉพาะทาง",
    "link": "https://hpc.cmu.ac.th/"
  },
  {
    "year": 2022,
    "systemName": "การรวม AI-HPC",
    "organization": "สถาบันหลายแห่ง",
    "description": "การรวมความสามารถปัญญาประดิษฐ์เข้ากับโครงสร้างพื้นฐาน HPC ทั่วมหาวิทยาลัยและศูนย์วิจัย รวมถึงระบบที่มหาวิทยาลัยเกษตรศาสตร์ (KU Nontri AI) และมหาวิทยาลัยมหิดล (MU-AI Center)",
    "link": "https://nontriai.ku.ac.th/"
  },
  {
    "year": 2023,
    "systemName": "HPC ภาคเอกชน",
    "organization": "บริษัท ปตท.สำรวจและผลิตปิโตรเลียม จำกัด (มหาชน)",
    "description": "การติดตั้ง 'The Crust 2.5' โดย ปตท.สผ. เป็นการลงทุน HPC ขนาดใหญ่ของภาคเอกชนที่มี CPU 47,360 คอร์ และ GPU NVIDIA H100 ประมาณ 512 ตัว สำหรับแอปพลิเคชันการสำรวจและผลิต",
    "link": "https://www.pttep.com/th/home"
  },
  {
    "year": 2024,
    "systemName": "เครือข่าย HPC ภูมิภาค",
    "organization": "มหาวิทยาลัยสงขลานครินทร์ มหาวิทยาลัยขอนแก่น",
    "description": "การขยายโครงสร้างพื้นฐาน HPC ไปยังมหาวิทยาลัยในภูมิภาค รวมถึง PSU-Singkhorn ในภาคใต้ และระบบ KKU ในภาคตะวันออกเฉียงเหนือ สร้างเครือข่าย HPC ระดับชาติอย่างแท้จริง",
    "link": "https://www.facebook.com/drii.psu"
  },
  {
    "year": 2025,
    "systemName": "วิสัยทัศน์ HPC รุ่นใหม่",
    "organization": "กลุ่ม HPC แห่งชาติ",
    "description": "แผนงานของประเทศไทยสำหรับ HPC รุ่นใหม่ รวมถึงความสามารถการคำนวณระดับเอกซาสเกล ระบบไฮบริดควอนตัม-คลาสสิก และโครงสร้างพื้นฐานการคำนวณที่ยั่งยืนเพื่อสนับสนุนการเปลี่ยนแปลงดิจิทัลระดับชาติ",
    "link": "https://thaisc.io/"
  }
]
